app/Controllers/Login_controller.php

	 public function loginPost()
    {

	//	 echo $this->session->getFlashdata('item');
       // echo session('username');


        $userModel = new UserModel();
		$result = $userModel->where('email',$this->request->getVar('email'))->
		where('password',$this->request->getVar('password'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'krishna@gmail.com'
AND `password` = 'kd@0562'
 LIMIT 1