app/Controllers/Login_controller.php

SELECT *
FROM `users`
WHERE `email` = 'krishna@gmail.com'
 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$gw46IUWBah0uVBsNuCWfaOCeCSkw35aic2D7MKRjHyZ2jKUXDlXLm'
WHERE `users`.`id` IN ('1')
---
	 public function loginPost()
    {

	//	 echo $this->session->getFlashdata('item');
       // echo session('username');


        $userModel = new UserModel();
		$email = $this->request->getPost('email');
		$password = $this->request->getPost('password');
		$result = $userModel->where('email', $email)->first();


             if($result && $this->isValidPassword($password, $result['password'])){
				 if (! password_get_info($result['password'])['algo']) {
					$userModel->update($result['id'], [
						'password' => password_hash($password, PASSWORD_DEFAULT),
					]);