app/Controllers/SignupController.php

public function signupPost()
    {
        // Load the User Model
        $userModel = new UserModel();

        // Get the input values from the form
        $account_name = $this->request->getPost('account_name');
        $account_number = $this->request->getPost('account_number');
		$email = $this->request->getPost('email');
		$password = $this->request->getPost('password');
		echo $account_name;
		echo $account_number;
		echo $email;
		echo $password;
		$data = [
    'account_name' => $account_name,
    'account_number' => $account_number,
    'email' => $email,
    'password' =>$password // Encrypt the password before storing
];

// Insert the data into the database
$userModel->insert($data);
---
INSERT INTO `users` (`account_name`, `account_number`, `email`, `password`) VALUES ('shalu', 'SHaluHDFC012', 'shalukumari@gmail.com', '$2y$10$QFSazzyB1QMDvcxSnWXTgOic7EZXwlcZdc4T8r91U7W1RB7G7DkdG')