app/Models/Accounts_data_model.php

INSERT INTO `accounts_data` (`id`, `account_number`, `as_on_date`, `fixed_amount`, `veriable_amount`, `diff_amount`, `updated_by`, `updated_date`) VALUES (NULL, 'NPS01', '2024-10-30', '100000.00', '', '', '1', '2024-10-10 11:10:12');
---
	public function set_accounts_data($request)
    {
		$datetime = date("Y-m-d H:i:s");
		$diffAmount = $request['diff_amount'] ?? '';

		if (trim((string) $diffAmount) === '') {
			$diffAmount = $request['veriable_amount'] - $request['fixed_amount'];
		}

		$data = [
			'account_number' => $request['account_number'],
			'as_on_date' => $request['as_on_date'],
			'fixed_amount' => $request['fixed_amount'],
			'veriable_amount' => $request['veriable_amount'],
			'diff_amount' => $diffAmount,
		];

		if ((int) $request['id'] === 0) {
			$data['updated_by'] = 1;
			$data['updated_date'] = $datetime;

			$this->db->table('accounts_data')->insert($data);