app/Models/Account_model.php

	public function update_account($id, $data)
	{
		$this->db->table('accounts')
			->where('id', $id)
			->update([
				'account_name'   => $data['account_name'] ?? '',
				'account_number' => $data['account_number'] ?? '',
				'bank_name'      => $data['bank_name'] ?? '',
				'account_type'   => $data['account_type'] ?? '',
				'closure_date'   => $data['closure_date'] ?? '',
				'interest_rate'  => $data['interest_rate'] ?? '',
			]);
---
UPDATE `accounts` SET `account_name` = 'bhai', `account_number` = 'MDUSSHARE01', `bank_name` = 'UPSTOX', `account_type` = 'Shares', `closure_date` = '0000-00-00', `interest_rate` = '0.00'
WHERE `id` = '58'